Documents/Маршрут.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Маршрут</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктуальныеМаршруты</xr:Item>
				<xr:Item>InformationRegister.ЗаданияТП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйПредставитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПосещений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Задания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПлана</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗадания</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнкеты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблонАнкетыДляТП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаданияТП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПосещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПосещенийКлиентовТорговымиПредставителями</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПосещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПосещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОС_ИдентификаторДляМобильногоУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойТипПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПосещенийКлиентовТорговымиПредставителями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнеплановогоПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПосещенийКлиентовТорговымиПредставителями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДополнительногоПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПосещенийКлиентовТорговымиПредставителями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПосещенияДляНовыхКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПосещенийКлиентовТорговымиПредставителями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПосещенияДляСпящихКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПосещенийКлиентовТорговымиПредставителями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИндивидуальныеНастройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбщийМодульПовтИсп/Ext/Module.bsl
Функция ВидыЗаданийТорговымПредставителямПолучитьПредопределенныйЭлемент( Идентификатор ) Экспорт
	Возврат Справочники.ВидыЗаданийТорговымПредставителям.ПолучитьПредопределенныйЭлемент( Идентификатор );
КонецФункции

Функция ШаблонАнкетыДляТППолучитьПредопределенныйЭлемент( Идентификатор ) Экспорт
	Возврат Справочники.ШаблонАнкетыДляТП.ПолучитьПредопределенныйЭлемент( Идентификатор );
КонецФункции

Функция ВидыКомментариевПолучитьПредопределенныйЭлемент( Идентификатор ) Экспорт
	Возврат Справочники.ВидыКомментариев.ПолучитьПредопределенныйЭлемент( Идентификатор );
КонецФункции

Функция ПолучитьОсновнойТипПосещения() Экспорт
	
	Всп = Константы.ТекущийПользователь.Получить();	Если Ложь Тогда	Всп = Справочники.Пользователи.СоздатьЭлемент();	КонецЕсли;
	Если ЗначениеЗаполнено( Всп ) И ЗначениеЗаполнено(Всп.ОсновнойТипПосещения) Тогда
		Возврат Всп.ОсновнойТипПосещения;
	Иначе
		Возврат Справочники.ТипыПосещенийКлиентовТорговымиПредставителями.НайтиПоРеквизиту("Идентификатор", "Стандартное");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипВнеплановогоПосещения() Экспорт
	
	Всп = Константы.ТекущийПользователь.Получить();	Если Ложь Тогда	Всп = Справочники.Пользователи.СоздатьЭлемент();	КонецЕсли;
	Если ЗначениеЗаполнено( Всп ) И ЗначениеЗаполнено(Всп.ТипВнеплановогоПосещения) Тогда
		Возврат Всп.ТипВнеплановогоПосещения;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутЗаданияТП.ТипПосещения,
		|	КОЛИЧЕСТВО(МаршрутЗаданияТП.НомерСтроки) КАК Кол
		|ИЗ
		|	Документ.Маршрут.ЗаданияТП КАК МаршрутЗаданияТП
		|
		|СГРУППИРОВАТЬ ПО
		|	МаршрутЗаданияТП.ТипПосещения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Кол УБЫВ";
		РезультатЗапроса = Запрос.Выполнить();
		
		ТЗ = РезультатЗапроса.Выгрузить();
		Если ТЗ.Количество() = 0 Тогда
			Возврат Константы.ТипВнеплановогоПосещения.Получить();
		Иначе
			Всп = ТЗ[0].ТипПосещения;
			Если ЗначениеЗаполнено(Всп) Тогда
				Возврат Всп;
			Иначе
				Возврат Константы.ТипВнеплановогоПосещения.Получить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипПосещенияТелефонныйЗвонок() Экспорт
	
	Всп = Константы.ТекущийПользователь.Получить();	Если Ложь Тогда	Всп = Справочники.Пользователи.СоздатьЭлемент();	КонецЕсли;
	Если ЗначениеЗаполнено( Всп ) И ЗначениеЗаполнено(Всп.ТипДополнительногоПосещения) Тогда
		Возврат Всп.ТипДополнительногоПосещения;
	Иначе
		Возврат Константы.ТипПосещенияТелефонныйЗвонок.Получить();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьФизЛицоТекущегоПользователя() Экспорт
	Всп = Константы.ТекущийПользователь.Получить();
	Если ЗначениеЗаполнено( Всп ) Тогда
		Возврат Всп.ФизЛицо;
	КонецЕсли;
КонецФункции
